In [1]:
import pandas as pd
import numpy as np

In [2]:
'''For our purpose, we will need two dataframes.
We can create a DataFrame using any data type like list,
dictionary, or series. We can also use a NumPy and array 
or another DataFrame to create it. Let’s use a dictionary for now.

'''

one = ({
     
  'emp_id':[1,2,3,4,5],
     
  'dept_name':['duvet','bidet','footwear','clothing','electronics'],
     
  'aisle':[1,2,3,4,5]})
    
df = pd.DataFrame(one,columns=['emp_id','dept_name','aisle'])
df
    
    # saving the dataframe  
df.to_csv('supermarket1.csv')

In [3]:
two = ({
  'emp_id':[6,7,8,9,10],
    
  'dept_name':['grocery','toys','laundry','frozen','stationery'],
    
  'aisle':[6,2,2,9,10]})

data = pd.DataFrame(two,columns=['emp_id','dept_name','aisle'])
data

data.to_csv('supermarket.csv')

In [4]:
''' Why we need Data Wrangling with Python
Much data obtained from various sources are raw and unusable. 
This could be messy or incomplete. With data wrangling with Python, 
we can perform operations on raw data to clean it out to an extent. 
Wrangling is essential to data science. Let’s take a quick look at it.'''

' Why we need Data Wrangling with Python\nMuch data obtained from various sources are raw and unusable. \nThis could be messy or incomplete. With data wrangling with Python, \nwe can perform operations on raw data to clean it out to an extent. \nWrangling is essential to data science. Let’s take a quick look at it.'

In [5]:
# readung through the csv files 

two=pd.read_csv(r'C:\Users\slowjerm.jerm1\Desktop\dataScience\data aggregation&Wrangling\supermarket1.csv')

three=pd.read_csv(r'C:\Users\slowjerm.jerm1\Desktop\dataScience\data aggregation&Wrangling\supermarket.csv')

In [6]:
 #Dropping Missing Values
#As you can see, we have no null values 

#Checking for null values 


three.isnull().any()

Unnamed: 0    False
emp_id        False
dept_name     False
aisle         False
dtype: bool

In [7]:
two.isnull().any()

Unnamed: 0    False
emp_id        False
dept_name     False
aisle         False
dtype: bool

In [11]:
 #Dropping Missing Values if any 
three.dropna()

   Unnamed: 0  emp_id   dept_name  aisle
0           0       6     grocery      6
1           1       7        toys      2
2           2       8     laundry      2
3           3       9      frozen      9
4           4      10  stationery     10

In [10]:
two.dropna()

   Unnamed: 0  emp_id    dept_name  aisle
0           0       1        duvet      1
1           1       2        bidet      2
2           2       3     footwear      3
3           3       4     clothing      4
4           4       5  electronics      5

In [12]:
''' Grouping Data
The pandas gorupby() method returns a DataFrameGroupBy object. Calling the method value_counts()
returns the number of occurrences for each unique value in the column we specify.'''

' Grouping Data\nThe pandas gorupby() method returns a DataFrameGroupBy object. Calling the method value_counts()\nreturns the number of occurrences for each unique value in the column we specify.'

In [14]:
three.groupby('aisle').dept_name.value_counts()

aisle  dept_name
2      laundry       1
       toys          1
6      grocery       1
9      frozen        1
10     stationery    1
Name: dept_name, dtype: int64

In [15]:
'''Th above  tells us about the correlation between aisle number and department name. This lets us discover trends in data.
In situations where we want to see trends by the city, we can group records by their geographical factors.'''

'Th above  tells us about the correlation between aisle number and department name. This lets us discover trends in data.\nIn situations where we want to see trends by the city, we can group records by their geographical factors.'

In [16]:
'''Finding unique values
For this, we can use the unique() method.'''

two.aisle.unique()

array([1, 2, 3, 4, 5], dtype=int64)

In [17]:
three.aisle.unique()

array([ 6,  2,  9, 10], dtype=int64)

In [18]:
'''Length of dataframe
Then len() function gives us the length of the dataframe.
'''
len(two)

5

In [20]:
len(three)

5

In [22]:
#Filtering Data
#To gain a subset of data using some criterion, we can filter out parts we need.
#Single condition,multiple condition ,Deescribing your data and Filtering through values

In [23]:
#Single condition uses operaters like ><== etc //Aisle greater than 3 from three dataset

three[three['aisle']>3]

   Unnamed: 0  emp_id   dept_name  aisle
0           0       6     grocery      6
3           3       9      frozen      9
4           4      10  stationery     10

In [26]:
#Single condition //Aisle greater is equal 2 from three dataset ,we can manipulate the various  columns 
three[three['aisle']==2]

   Unnamed: 0  emp_id dept_name  aisle
1           1       7      toys      2
2           2       8   laundry      2

In [27]:
#Multiple Conditions combination of operators inclusing logical operators etc 
#belwo example,shows aisle equal to 2 and department equal to toys from three dataset

   Unnamed: 0  emp_id dept_name  aisle
1           1       7      toys      2

In [28]:
#Describing your Data

(three[(three['aisle']==2) & (three['dept_name']=='toys')]).describe()

       Unnamed: 0  emp_id  aisle
count         1.0     1.0    1.0
mean          1.0     7.0    2.0
std           NaN     NaN    NaN
min           1.0     7.0    2.0
25%           1.0     7.0    2.0
50%           1.0     7.0    2.0
75%           1.0     7.0    2.0
max           1.0     7.0    2.0

In [30]:
#Filtering through Values

#filtering through aisle values 2,7,9 (emp_id). we isin() function 

three[three.aisle.isin([2,7,9])]

   Unnamed: 0  emp_id dept_name  aisle
1           1       7      toys      2
2           2       8   laundry      2
3           3       9    frozen      9

In [31]:
#Pivoting Dataset
#Pivoting lets us reshape a DataFrame by column/index values. In other words, it produces a pivot table.

(three.pivot(index='emp_id',columns='aisle',values='dept_name')).tail()

aisle        2        6       9           10
emp_id
6           NaN  grocery     NaN         NaN
7          toys      NaN     NaN         NaN
8       laundry      NaN     NaN         NaN
9           NaN      NaN  frozen         NaN
10          NaN      NaN     NaN  stationery

In [32]:
#Providing a number to this tail() call will give us that many records

(three.pivot(index='emp_id',columns='aisle',values='dept_name')).tail(3)

aisle        2    6       9           10
emp_id
8       laundry  NaN     NaN         NaN
9           NaN  NaN  frozen         NaN
10          NaN  NaN     NaN  stationery

In [33]:
'''Shifting a pivoted dataset
We can shift the DataFrame’s index by a certain number of periods using the shift() method.'''

(two.pivot(index='emp_id',columns='aisle',values='dept_name')).tail(3).shift(1)

aisle     1    2         3         4    5
emp_id
3       NaN  NaN       NaN       NaN  NaN
4       NaN  NaN  footwear       NaN  NaN
5       NaN  NaN       NaN  clothing  NaN

In [40]:
three.head()

   Unnamed: 0  emp_id   dept_name  aisle
0           0       6     grocery      6
1           1       7        toys      2
2           2       8     laundry      2
3           3       9      frozen      9
4           4      10  stationery     10

In [46]:
#Melting Shifted Datasets
#We can also melt a dataset (unpivot it).

(three.melt(id_vars=['emp_id'],value_name='dept_name')).tail()

    emp_id variable dept_name
10       6    aisle         6
11       7    aisle         2
12       8    aisle         2
13       9    aisle         9
14      10    aisle        10

In [48]:
#Merging Melted Data
#We can join melted DataFrames into one Analytical Base Table using the merge() function.

melt1=three.melt(id_vars=['emp_id'],value_name='dept_name')
melt2=three.melt(id_vars=['emp_id'],value_name='aisle')
pd.merge(melt1,melt2,on=['emp_id']).tail()

    emp_id variable_x   dept_name  variable_y       aisle
40      10  dept_name  stationery   dept_name  stationery
41      10  dept_name  stationery       aisle          10
42      10      aisle          10  Unnamed: 0           4
43      10      aisle          10   dept_name  stationery
44      10      aisle          10       aisle          10

In [50]:
#Reducing into an Aanalytical Base Tree(abt)
#Finally, to reduce this result into an analytical base table, we do the following

from functools import reduce

base=three[['aisle','dept_name','emp_id']]
feature=[base]+[melt1,melt2]
abt=reduce(lambda left,right: pd.merge(left,right,on=['emp_id']),[melt1,melt2])
abt.tail()

    emp_id variable_x   dept_name  variable_y       aisle
40      10  dept_name  stationery   dept_name  stationery
41      10  dept_name  stationery       aisle          10
42      10      aisle          10  Unnamed: 0           4
43      10      aisle          10   dept_name  stationery
44      10      aisle          10       aisle          10

In [52]:
#Concatenating Data
#We can concatenate datasets along an axis using the concat() method.
concatenating dataset two andd three (we can concatenate cos they have ssimilar features)
pd.concat([two,three])

   Unnamed: 0  emp_id    dept_name  aisle
0           0       1        duvet      1
1           1       2        bidet      2
2           2       3     footwear      3
3           3       4     clothing      4
4           4       5  electronics      5
0           0       6      grocery      6
1           1       7         toys      2
2           2       8      laundry      2
3           3       9       frozen      9
4           4      10   stationery     10

In [54]:
# Exporting Data
#Finally, we can export our clean and filtered data to an Excel sheet.
res=pd.concat([two,three])
res.to_excel('res.xlsx')